CREATE TABLE Studentssss (
    id INT PRIMARY KEY,
    fio NVARCHAR(100),
    predmet NVARCHAR(100),
    ush NVARCHAR(100),
    ball FLOAT
);

INSERT INTO Studentssss (id, fio, predmet, ush, ball) VALUES
(1, 'Иванова', 'Математика', 'Лицей', 98.5),
(2, 'Петров', 'Математика', 'Гимназия', 85.0),
(3, 'Сидоров', 'Физика', 'Лицей', 92.0),
(4, 'Кузнецов', 'Математика', 'Гимназия', 78.0),
(5, 'Иванова', 'Химия', 'Лицей', 88.5),
(6, 'Петров', 'Физика', 'Гимназия', 76.0),
(7, 'Сидоров', 'Химия', 'Гимназия', 89.0),
(8, 'Кузнецов', 'Физика', 'Гимназия', 65.0),
(9, 'Иванова', 'Математика', 'Гимназия', 70.0);