Repository: foreverNP/BSU
Catalog: 3.2/mobile/lab10/lab10/lib/l10n/app_*.arb
Languages: be, ru

# languageCode
source: en
be: be
ru: ru

# minskLibraries
source: Minsk's libraries
be: Бібліятэкі Мінска
ru: Библиотеки Минска

# districts
source: District:
be: Раён:
ru: Район:

source: Weather:
be: Надвор'е:
ru: Погода:

source: Choose district
be: Абярыце раён
ru: Выберите район

# centralny
source: Centralny district
be: Цэнтральны раён
ru: Центральный район

# sovetsky
source: Sovetsky district
be: Савецкі раён
ru: Советский район

# pervomaysky
source: Pervomaysky district
be: Першамайскі раён
ru: Первомайский район

# partizansky
source: Partizansky district
be: Партызанскі раён
ru: Партизанский район

# oktyabrsky
source: Oktyabrsky district
be: Кастрычніцкі раён
ru: Октябрьский район

# leninsky
source: Leninsky district
be: Ленінскі раён
ru: Ленинский район

# zavodskoy
source: Zavodskoy district
be: Завадскі раён
ru: Заводской район

# moskovsky
source: Moskovsky district
be: Маскоўскі раён
ru: Московский район

# frunzensky
source: Frunzensky district
be: Фрунзенскі раён
ru: Фрунзенский район

# libraryKupala
source: Central City Library named after Yanka Kupala
be: Цэнтральная гарадская бібліятэка імя Янкі Купалы
ru: Центральная городская библиотека им. Янки Купалы

# libraryPushkin
source: Library named after Pushkin
be: Бібліятэка імя Пушкіна
ru: Библиотека им. Пушкина

# library5
source: Library No. 5
be: Бібліятэка №5
ru: Библиотека №5

# librarySkorina
source: Library No. 1 named after Francysk Skaryna
be: Бібліятэка №1 імя Францыска Скарыны
ru: Библиотека №1 им. Франциска Скорины

# library6
source: Library No. 6
be: Бібліятэка №6
ru: Библиотека №6

# library7
source: Library No. 7
be: Бібліятэка №7
ru: Библиотека №7

# library8
source: Library No. 8
be: Бібліятэка №8
ru: Библиотека №8

# library9
source: Library No. 9
be: Бібліятэка №9
ru: Библиотека №9

# library10
source: Library No. 10
be: Бібліятэка №10
ru: Библиотека №10

# library2
source: Library No. 2
be: Бібліятэка №2
ru: Библиотека №2

# library11
source: Library No. 11
be: Бібліятэка №11
ru: Библиотека №11

# library12
source: Library No. 12
be: Бібліятэка №12
ru: Библиотека №12

# library13
source: Library No. 13
be: Бібліятэка №13
ru: Библиотека №13

# library14
source: Library No. 14
be: Бібліятэка №14
ru: Библиотека №14

# library15
source: Library No. 15
be: Бібліятэка №15
ru: Библиотека №15

# library3
source: Library No. 3
be: Бібліятэка №3
ru: Библиотека №3

# library16
source: Library No. 16
be: Бібліятэка №16
ru: Библиотека №16

# library17
source: Library No. 17
be: Бібліятэка №17
ru: Библиотека №17

# library18
source: Library No. 18
be: Бібліятэка №18
ru: Библиотека №18

# library19
source: Library No. 19
be: Бібліятэка №19
ru: Библиотека №19

# library20
source: Library No. 20
be: Бібліятэка №20
ru: Библиотека №20

# library21
source: Library No. 21
be: Бібліятэка №21
ru: Библиотека №21

# library22
source: Library No. 22
be: Бібліятэка №22
ru: Библиотека №22

# library23
source: Library No. 23
be: Бібліятэка №23
ru: Библиотека №23

# library24
source: Library No. 24
be: Бібліятэка №24
ru: Библиотека №24

# library25
source: Library No. 25
be: Бібліятэка №25
ru: Библиотека №25

# library26
source: Library No. 26
be: Бібліятэка №26
ru: Библиотека №26

# addrLenina16
source: 16 Lenina St.
be: вул. Леніна, 16
ru: ул. Ленина, 16

# addrInternatsionalnaya25
source: 25 Internatsionalnaya St.
be: вул. Інтэрнацыянальная, 25
ru: ул. Интернациональная, 25

# addrMarksa40
source: 40 Karl Marx St.
be: вул. Карла Маркса, 40
ru: ул. Карла Маркса, 40

# addrNezavisimosti10
source: 10 Nezavisimosti Ave.
be: пр-т Незалежнасці, 10
ru: пр-т Независимости, 10

# addrKedyshko11
source: 11 Kedyshko St.
be: вул. Кедышка, 11
ru: ул. Кедышко, 11

# addrYakubaKolasa31
source: 31 Yakuba Kolasa St.
be: вул. Якуба Коласа, 31
ru: ул. Якуба Коласа, 31

# addrKalinovskogo55
source: 55 Kalinovskogo St.
be: вул. Каліноўскага, 55
ru: ул. Калиновского, 55

# addrGamarnika25
source: 25 Gamarnika St.
be: вул. Гамарніка, 25
ru: ул. Гамарника, 25

# addrRussyianova4
source: 4 Russiyanova St.
be: вул. Русіянава, 4
ru: ул. Руссиянова, 4

# addrMoskovskaya25
source: 25 Moskovskaya St.
be: вул. Маскоўская, 25
ru: ул. Московская, 25

# addrVaupsasova10
source: 10 Vaupsasova St.
be: вул. Ваупшасава, 10
ru: ул. Ваупшасова, 10

# addrKuzmyChornogo5
source: 5 Kuzmy Chornogo St.
be: вул. Кузьмы Чорнага, 5
ru: ул. Кузьмы Чорного, 5

# addrUlyanovskaya15
source: 15 Ulyanovskaya St.
be: вул. Ульянаўская, 15
ru: ул. Ульяновская, 15

# addrSverdlova21
source: 21 Sverdlova St.
be: вул. Свярдлова, 21
ru: ул. Свердлова, 21

# addrTolstogo3
source: 3 Tolstogo St.
be: вул. Талстога, 3
ru: ул. Толстого, 3

# addrKlaryTsetkin15
source: 15 Klary Tsetkin St.
be: вул. Клары Цэткін, 15
ru: ул. Клары Цеткин, 15

# addrShorsa5
source: 5 Shorsa St.
be: вул. Шорса, 5
ru: ул. Щорса, 5

# addrKazintsa6
source: 6 Kazintsa St.
be: вул. Казінца, 6
ru: ул. Казинца, 6

# addrRadialnaya12
source: 12 Radialnaya St.
be: вул. Радыяльная, 12
ru: ул. Радиальная, 12

# addrSoltysa21
source: 21 Soltysa St.
be: вул. Солтыса, 21
ru: ул. Солтыса, 21

# addrAngarskaya14
source: 14 Angarskaya St.
be: вул. Ангарская, 14
ru: ул. Ангарская, 14

# addrKizhevatova6
source: 6 Kizhevatova St.
be: вул. Кіжаватава, 6
ru: ул. Кижеватова, 6

# addrOdintsova21
source: 21 Odintsova St.
be: вул. Адзінцова, 21
ru: ул. Одинцова, 21

# addrMelnikayte4
source: 4 Melnikayte St.
be: вул. Мельнікайте, 4
ru: ул. Мельникайте, 4

# addrKuntsevshchina6
source: 6 Kuntsevshchina St.
be: вул. Кунцаўшчына, 6
ru: ул. Кунцевщина, 6

# addrMatusevicha58
source: 58 Matusevicha St.
be: вул. Матусевіча, 58
ru: ул. Матусевича, 58

# addrPetraGlebki5
source: 5 Petra Glebki St.
be: вул. Пятра Глебкі, 5
ru: ул. Петра Глебки, 5
