-- 1.1 Создание таблицы Student
DROP TABLE IF EXISTS Student;

CREATE TABLE Student (
    FIO NVARCHAR(100) NOT NULL,
    Data DATE NOT NULL,
    spez NVARCHAR(50) NOT NULL,
    godpost INT NOT NULL
);
GO

INSERT INTO Student (FIO, Data, spez, godpost) VALUES
(N'Александров Николай Николаевич', '2001-01-01', N'физика', 2018),
(N'Бельский Василий Владимирович', '2001-05-02', N'математика', 2019),
(N'Белопольский Андрей Иванович', '2004-10-04', N'Информатика', 2022),
(N'Петров Иван Петрович', '2004-07-17', N'физика', 2022),
(N'Михайлов Николай Иванович', '2005-12-09', N'математика', 2023),
(N'Мироненко Светлана Владимировна', '1998-12-09', N'Радиофизика', 2016),
(N'Коваленко Владимир Иванович', '2003-12-09', N'Информатика', 2019),
(N'Виноградов Павел Григорьевич', '2003-12-09', N'Химия', 2021),
(N'Иванов Владимир Николаевич', '1999-12-09', N'Радиофизика', 2018),
(N'Семашкина Виктория Михайловна', '1998-12-09', N'Химия', 2017);
GO

-- 1.2 Создание таблицы Студент_Архив
DROP TABLE IF EXISTS Студент_Архив;

CREATE TABLE Студент_Архив (
    FIO NVARCHAR(100) NULL,
    Data DATE NULL,
    spez NVARCHAR(50) NULL,
    godpost INT NULL,
    Удалено DATETIME NOT NULL
);
