-- Создание таблицы Tabl_Kontinent$
CREATE TABLE Tabl_Kontinent$ (
    Nazvanie NVARCHAR(50),
    Stolica NVARCHAR(50),
    PL INT,
    KolNas BIGINT,
    Kontinent NVARCHAR(50)
);

-- Вставка данных в таблицу Tabl_Kontinent$
INSERT INTO Tabl_Kontinent$ (Nazvanie, Stolica, PL, KolNas, Kontinent)
VALUES
    (N'Австрия', N'Вена', 83858, 8741753, N'Европа'),
    (N'Азербайджан', N'Баку', 86600, 9705600, N'Азия'),
    (N'Албания', N'Тирана', 28748, 2866376, N'Европа'),
    (N'Алжир', N'Алжир', 2381740, 39313372, N'Африка'),
    (N'Ангола', N'Луанда', 1246700, 25831000, N'Африка'),
    (N'Аргентина', N'Буэнос-Айрес', 2766890, 43847000, N'Южная Америка'),
    (N'Афганистан', N'Кабул', 647500, 29822848, N'Азия'),
    (N'Бангладеш', N'Дакка', 144000, 160221000, N'Азия'),
    (N'Бахрейн', N'Манама', 701, 1397000, N'Азия'),
    (N'Белиз', N'Бельмопан', 22966, 377968, N'Северная Америка'),
    (N'Белоруссия', N'Минск', 207595, 9498400, N'Европа'),
    (N'Бельгия', N'Брюссель', 30528, 11250585, N'Европа'),
    (N'Бенин', N'Порто-Ново', 112620, 11167000, N'Африка'),
    (N'Болгария', N'София', 110910, 7153784, N'Европа'),
    (N'Боливия', N'Сукре', 1098580, 10985059, N'Южная Америка'),
    (N'Ботсвана', N'Габороне', 600370, 2209208, N'Африка'),
    (N'Бразилия', N'Бразилиа', 8511965, 206081432, N'Южная Америка'),
    (N'Буркина-Фасо', N'Уагадугу', 274200, 19034397, N'Африка'),
    (N'Бутан', N'Тхимпху', 47000, 784000, N'Азия'),
    (N'Великобритания', N'Лондон', 244820, 65341183, N'Европа'),
    (N'Венгрия', N'Будапешт', 93030, 9830485, N'Европа'),
    (N'Венесуэла', N'Каракас', 912050, 31028637, N'Южная Америка'),
    (N'Восточный Тимор', N'Дили', 14874, 1167242, N'Азия'),
    (N'Вьетнам', N'Ханой', 329560, 91713300, N'Азия');
